**TASK 1 :** There are three different tables as given above. Please make three dataframe in python
and save them as three .csv files. From Task 2 to Task 10, use the saved .csv files only.

In [1]:
# Create three DataFrames based on the tables in the reference and save as CSVs

# ------------------------------------------------------------
# Task 1: Create three DataFrames and save them as .csv files
# ------------------------------------------------------------

import pandas as pd


# 1) -------------------- Projects DataFrame --------------------
# Define rows exactly as per the given table in the reference.

project_rows = [
    {"ID":"A001","Project":"Project 1","Cost":1002000,"Status":"Finished"},
    {"ID":"A002","Project":"Project 2","Cost":2000000,"Status":"Ongoing"},
    {"ID":"A003","Project":"Project 3","Cost":4500000,"Status":"Finished"},
    {"ID":"A004","Project":"Project 4","Cost":5500000,"Status":"Ongoing"},
    {"ID":"A005","Project":"Project 5","Cost":"Nan","Status":"Finished"},
    {"ID":"A002","Project":"Project 6","Cost":680000,"Status":"Failed"},
    {"ID":"A005","Project":"Project 7","Cost":400000,"Status":"Finished"},
    {"ID":"A003","Project":"Project 8","Cost":350000,"Status":"Failed"},
    {"ID":"A001","Project":"Project 9","Cost":"Nan","Status":"Ongoing"},
    {"ID":"A003","Project":"Project 10","Cost":300000,"Status":"Finished"},
    {"ID":"A001","Project":"Project 11","Cost":2000000,"Status":"Failed"},
    {"ID":"A004","Project":"Project 12","Cost":1000000,"Status":"Ongoing"},
    {"ID":"A004","Project":"Project 13","Cost":3000000,"Status":"Finished"},
    {"ID":"A005","Project":"Project 14","Cost":200000,"Status":"Finished"},
]
df_projects = pd.DataFrame(project_rows)

# 2) -------------------- Employees DataFrame -------------------
employee_rows = [
    {"ID":"A001","Name":"John Alter","Gender":"M","City":"Paris","Age":25},
    {"ID":"A002","Name":"Alice Luxumberg","Gender":"F","City":"London","Age":27},
    {"ID":"A003","Name":"Tom Sabestine","Gender":"M","City":"Berlin","Age":29},
    {"ID":"A004","Name":"Nina Adgra","Gender":"F","City":"Newyork","Age":31},
    {"ID":"A005","Name":"Amy Johny","Gender":"F","City":"Madrid","Age":30},
]
df_employees = pd.DataFrame(employee_rows)

# 3) --------------- Seniority Level DataFrame -----------------
seniority_rows = [
    {"ID":"A001","Designation Level":2},
    {"ID":"A002","Designation Level":2},
    {"ID":"A003","Designation Level":3},
    {"ID":"A004","Designation Level":2},
    {"ID":"A005","Designation Level":3},
]
df_seniority = pd.DataFrame(seniority_rows)

# Save as CSVs (no index)
df_projects.to_csv("projects.csv", index=False)
df_employees.to_csv("employees.csv", index=False)
df_seniority.to_csv("seniority.csv", index=False)

In [2]:
#Reading and displaying the dataframe

projects = pd.read_csv("projects.csv")
employees = pd.read_csv("employees.csv")
seniority = pd.read_csv("seniority.csv")

display(projects)
display(employees)
display(seniority)

      ID     Project     Cost    Status
0   A001   Project 1  1002000  Finished
1   A002   Project 2  2000000   Ongoing
2   A003   Project 3  4500000  Finished
3   A004   Project 4  5500000   Ongoing
4   A005   Project 5      Nan  Finished
5   A002   Project 6   680000    Failed
6   A005   Project 7   400000  Finished
7   A003   Project 8   350000    Failed
8   A001   Project 9      Nan   Ongoing
9   A003  Project 10   300000  Finished
10  A001  Project 11  2000000    Failed
11  A004  Project 12  1000000   Ongoing
12  A004  Project 13  3000000  Finished
13  A005  Project 14   200000  Finished

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

**TASK 2 :** The cost column in the dataframe “Project” has some missing values. Your task is to
compute these missing values. Replace the missing values by running average. You
should use the “For” loop for this task.

In [3]:

# ------------------------------------------------------------
# Task 2: Fill missing 'Cost' values using a running average
# (with a for-loop), show ALL rows, and save the cleaned file.
# ------------------------------------------------------------

import pandas as pd
from IPython.display import display

# Loading projects data
df = pd.read_csv("projects.csv")

# Convert 'Cost' to numeric for all rows
df["Cost"] = pd.to_numeric(df["Cost"], errors="coerce")

print("\n BEFORE CLEANING: The projects dataframe table:")
display(df)

# If the very first rows are missing, we use the overall average (global mean)
global_mean = df["Cost"].mean()

# Running sum and count of previous rows to compute the average.
cum_sum = 0.0   # sum of all valid costs
count   = 0     # count of costs

# Loop through each row and fill missing costs
for i in range(len(df)):
    current_cost = df.loc[i, "Cost"]

    if pd.isna(current_cost):
        # If it already have previous values, using their average.
        # Otherwise using the global mean.
        df.loc[i, "Cost"] = (cum_sum / count) if count > 0 else global_mean

        # Updating current_cost to the value
        current_cost = df.loc[i, "Cost"]

    # Updating the running sum and count with the current value
    cum_sum += float(current_cost)
    count   += 1

print("\n AFTER CLEANING: All missing 'Cost' values are filled with the running average.")
display(df)

# To confirm that there are no remaining missing values in the Cost column
missing_after = df["Cost"].isna().sum()
print(f"\n Missing 'Cost' values remaining: {missing_after}")

# Now, printing the filled values for missing rows:
#    - Project 5 is at index 4
#    - Project 9 is at index 8
print("\n Filled values:")
print("• Project 5 (index 4) Cost =", df.loc[4, "Cost"])
print("• Project 9 (index 8) Cost =", df.loc[8, "Cost"])

# Save the cleaned data for later tasks
df.to_csv("projects_cleaned.csv", index=False)
print("\n Saved: projects_cleaned.csv (to use this for the next tasks)")

 BEFORE CLEANING: The projects dataframe table:

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

 AFTER CLEANING: All missing 'Cost' values are filled with the running average.

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3250500.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9  2210312.5   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

 Missing 'Cost' values remaining: 0

 Filled values:
• Project 5 (index 4) Cost = 3250500.0
• Project 9 (index 8) Cost = 2210312.5

 Saved: projects_cleaned.csv (to use this for the next tasks)

**TASK 3 :** Split the name column in the Employee dataframe into two new columns “First Name”,
and “LastName” and remove the older “name” column.

In [4]:

# ------------------------------------------------------------
# Task 3: Split 'Name' into 'First Name' and 'LastName'
# and remove the original 'Name' column.
# ------------------------------------------------------------

import pandas as pd              
from IPython.display import display 


df = pd.read_csv("employees.csv")  # read employees file

print("\n BEFORE: Employee DataFrame (with the 'Name' column)")  # message before change
display(df)                            

# removing extra spaces
df["Name"] = df["Name"].astype(str).str.strip()  

# split on the first space only
parts = df["Name"].str.split(r"\s+", n=1, expand=True)  # split into two parts

# first part is first name
df["First Name"] = parts[0]   
# second part is last name; fill empty if missing
df["LastName"]   = parts[1].fillna("")  

# removing old Name column
df.drop(columns=["Name"], inplace=True)  

print("\n AFTER: Employee DataFrame with 'First Name' and 'LastName' (old 'Name' removed)")  
 # shows table after change
display(df)                                        

df.to_csv("employees_updated.csv", index=False)     # save new file
print("Saved: employees_updated.csv")               # confirm save

 BEFORE: Employee DataFrame (with the 'Name' column)

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

 AFTER: Employee DataFrame with 'First Name' and 'LastName' (old 'Name' removed)

     ID Gender     City  Age First Name   LastName
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

Saved: employees_updated.csv

**TASK 4 :** Join all three dataframes in one single dataframe. Name it “Final”

In [5]:

# ------------------------------------------------------------
# Task 4: Join the three updated tables into one final table
#          and save it as "Final.csv"
# ------------------------------------------------------------

import pandas as pd
from IPython.display import display

#  Reading the updated CSVs produced by previous tasks
try:
    df_employees = pd.read_csv("employees_updated.csv")   # Task 3 output: First Name + LastName
    df_projects  = pd.read_csv("projects_cleaned.csv")    # Task 2 output: Cost filled
    df_seniority = pd.read_csv("seniority.csv")           # Task 1 base
except FileNotFoundError as e:
    raise FileNotFoundError(
        "One or more input files were not found. Please make sure these files exist:\n"
        "- employees_updated.csv (Task 3)\n"
        "- projects_cleaned.csv  (Task 2)\n"
        "- seniority.csv         (Task 1)\n"
    ) from e

# Doing Quick sanity check: To confirm expected columns exist
required_emp_cols = {"ID", "Gender", "City", "Age", "First Name", "LastName"}
required_proj_cols = {"ID", "Project", "Cost", "Status"}
required_sen_cols  = {"ID", "Designation Level"}

missing_emp = required_emp_cols - set(df_employees.columns)
missing_proj = required_proj_cols - set(df_projects.columns)
missing_sen  = required_sen_cols  - set(df_seniority.columns)

if missing_emp or missing_proj or missing_sen:
    print("\n Column check:")
    if missing_emp:  print(" - Employees file missing:", ", ".join(sorted(missing_emp)))
    if missing_proj: print(" - Projects file  missing:", ", ".join(sorted(missing_proj)))
    if missing_sen:  print(" - Seniority file missing:", ", ".join(sorted(missing_sen)))
    raise ValueError("Please fix the missing columns before continuing.")

# Join employees with projects on 'ID'
final_step1 = pd.merge(df_employees, df_projects, on="ID", how="inner")

# Add the seniority info on 'ID'
Final = pd.merge(final_step1, df_seniority, on="ID", how="inner")

# Making the table easy to read: sort and reset index
Final = Final.sort_values(["ID", "Project"]).reset_index(drop=True)

print("\n Final Table :")

# Show the final combined table
display(Final)

# Save the final table for later tasks
Final.to_csv("Final.csv", index=False)
print(" Saved: Final.csv")

 Final Table :

,ID,Gender,City,Age,First Name,LastName,Project,Cost,Status,Designation Level
0,A001,M,Paris,25,John,Alter,Project 1,1002000.0,Finished,2
1,A001,M,Paris,25,John,Alter,Project 11,2000000.0,Failed,2
2,A001,M,Paris,25,John,Alter,Project 9,2210312.5,Ongoing,2
3,A002,F,London,27,Alice,Luxumberg,Project 2,2000000.0,Ongoing,2
4,A002,F,London,27,Alice,Luxumberg,Project 6,680000.0,Failed,2
5,A003,M,Berlin,29,Tom,Sabestine,Project 10,300000.0,Finished,3
6,A003,M,Berlin,29,Tom,Sabestine,Project 3,4500000.0,Finished,3
7,A003,M,Berlin,29,Tom,Sabestine,Project 8,350000.0,Failed,3
8,A004,F,Newyork,31,Nina,Adgra,Project 12,1000000.0,Ongoing,2
9,A004,F,Newyork,31,Nina,Adgra,Project 13,3000000.0,Finished,2
10,A004,F,Newyork,31,Nina,Adgra,Project 4,5500000.0,Ongoing,2
11,A005,F,Madrid,30,Amy,Johny,Project 14,200000.0,Finished,3
12,A005,F,Madrid,30,Amy,Johny,Project 5,3250500.0,Finished,3
13,A005,F,Madrid,30,Amy,Johny,Project 7,400000.0,Finished,3

 Saved: Final.csv

**TASK 5 :** Add a new bonus column in the Final dataframe. Give a 5% bonus concerning project 
cost only to employees who have finished the projects.

In [6]:

# ------------------------------------------------------------
# Task 5: Add a "Bonus" column to Final
# Rule: Give 5% of project Cost as bonus ONLY if Status == "Finished"
# ------------------------------------------------------------

import pandas as pd
from IPython.display import display

# Loading the final table created in Task 4
Final = pd.read_csv("Final.csv")

print("\n Final.csv before adding Bonus Column")
display(Final)

# Make sure 'Cost' is numeric
Final["Cost"] = pd.to_numeric(Final["Cost"], errors="coerce")

# Creating a clean status flag (lowercase, trimmed) to avoid mismatch like 'finished ' etc.
status_clean = Final["Status"].astype(str).str.strip().str.lower()

# Compute bonus:
#    - If status is "finished": bonus = 5% of Cost
#    - Otherwise: bonus = 0
#    - If Cost is missing (NaN): bonus should be 0 to be safe
Final["Bonus"] = 0.0  # start with zero for everyone
Final.loc[(status_clean == "finished") & (Final["Cost"].notna()), "Bonus"] = Final["Cost"] * 0.05

print("\n After adding Final.csv Bonus Column :")

# Display final.csv file
display(Final)

# Save the updated file for later tasks
Final.to_csv("Final_with_bonus.csv", index=False)
print(" Saved: Final_with_bonus.csv")

 Final.csv before adding Bonus Column

,ID,Gender,City,Age,First Name,LastName,Project,Cost,Status,Designation Level
0,A001,M,Paris,25,John,Alter,Project 1,1002000.0,Finished,2
1,A001,M,Paris,25,John,Alter,Project 11,2000000.0,Failed,2
2,A001,M,Paris,25,John,Alter,Project 9,2210312.5,Ongoing,2
3,A002,F,London,27,Alice,Luxumberg,Project 2,2000000.0,Ongoing,2
4,A002,F,London,27,Alice,Luxumberg,Project 6,680000.0,Failed,2
5,A003,M,Berlin,29,Tom,Sabestine,Project 10,300000.0,Finished,3
6,A003,M,Berlin,29,Tom,Sabestine,Project 3,4500000.0,Finished,3
7,A003,M,Berlin,29,Tom,Sabestine,Project 8,350000.0,Failed,3
8,A004,F,Newyork,31,Nina,Adgra,Project 12,1000000.0,Ongoing,2
9,A004,F,Newyork,31,Nina,Adgra,Project 13,3000000.0,Finished,2
10,A004,F,Newyork,31,Nina,Adgra,Project 4,5500000.0,Ongoing,2
11,A005,F,Madrid,30,Amy,Johny,Project 14,200000.0,Finished,3
12,A005,F,Madrid,30,Amy,Johny,Project 5,3250500.0,Finished,3
13,A005,F,Madrid,30,Amy,Johny,Project 7,400000.0,Finished,3

 After adding Final.csv Bonus Column :

,ID,Gender,City,Age,First Name,LastName,Project,Cost,Status,Designation Level,Bonus
0,A001,M,Paris,25,John,Alter,Project 1,1002000.0,Finished,2,50100.0
1,A001,M,Paris,25,John,Alter,Project 11,2000000.0,Failed,2,0.0
2,A001,M,Paris,25,John,Alter,Project 9,2210312.5,Ongoing,2,0.0
3,A002,F,London,27,Alice,Luxumberg,Project 2,2000000.0,Ongoing,2,0.0
4,A002,F,London,27,Alice,Luxumberg,Project 6,680000.0,Failed,2,0.0
5,A003,M,Berlin,29,Tom,Sabestine,Project 10,300000.0,Finished,3,15000.0
6,A003,M,Berlin,29,Tom,Sabestine,Project 3,4500000.0,Finished,3,225000.0
7,A003,M,Berlin,29,Tom,Sabestine,Project 8,350000.0,Failed,3,0.0
8,A004,F,Newyork,31,Nina,Adgra,Project 12,1000000.0,Ongoing,2,0.0
9,A004,F,Newyork,31,Nina,Adgra,Project 13,3000000.0,Finished,2,150000.0
10,A004,F,Newyork,31,Nina,Adgra,Project 4,5500000.0,Ongoing,2,0.0
11,A005,F,Madrid,30,Amy,Johny,Project 14,200000.0,Finished,3,10000.0
12,A005,F,Madrid,30,Amy,Johny,Project 5,3250500.0,Finished,3,162525.0
13,A005,F,Madrid,30,Amy,Johny,Project 7,400000.0,Finished,3,20000.0

 Saved: Final_with_bonus.csv

**TASK 6 :** Demote the designation level by 1, whose projects have status “fail”. Delete the
employees record whose designation level is above 4.

In [7]:

# ------------------------------------------------------------
# Task 6: 
# - Demote designation level by 1 for employees with any failed projects.
# - Delete rows whose designation level is above 4.
# ------------------------------------------------------------

import os
import pandas as pd
from IPython.display import display

# Loading the Final file Final_with_bonus.csv
input_file = "Final_with_bonus.csv" if os.path.exists("Final_with_bonus.csv") else "Final.csv"

Final = pd.read_csv(input_file)

print(f"\n Loaded Input File {input_file}")
display(Final)

# Normalizing 'Status' text for safe comparison (strip spaces, lowercase)
status_clean = Final["Status"].astype(str).str.strip().str.lower()

# Searching all the employee IDs that have at least one failed project
failed_ids = set(Final.loc[status_clean == "failed", "ID"])

print(f"\n Employees with at least one failed project: {sorted(failed_ids)}")

# if an employee failed any project, reducing their designation level by 1 across all their rows.
Final["Designation Level"] = Final["Designation Level"].astype(int)  # ensuring numeric integer
Final.loc[status_clean.isin(["failed", "fail"]), "Designation Level"] = Final.loc[status_clean.isin(["failed", "fail"]), "Designation Level"] - 1

# Ensure designation levels stay reasonable and never go below level 1.
Final["Designation Level"] = Final["Designation Level"].clip(lower=1)

print("\n Applied demotions (by 1) to employees with failed projects.")
display(Final[["ID", "First Name", "LastName", "Project", "Status", "Designation Level"]].head(12))

# Delete rows where designation level is above 4
before_count = len(Final)
Final = Final[Final["Designation Level"] <= 4].copy()
after_count = len(Final)

print(f"\n Removed rows with designation level > 4.")
print(f" - Rows count before change: {before_count}")
print(f" - Rows count after change: {after_count}")

# Save the updated table
output_file = "Final_task6.csv"
Final.to_csv(output_file, index=False)

print(f"\n Output File: {output_file}")
print(" Demoted employees with failed projects by 1 (min level = 1), and removed rows with designation > 4.")

# Tidy view with key columns
print("\n Preview of the updated table:")
display(Final.sort_values(["ID", "Project"]).reset_index(drop=True))

 Loaded Input File Final_with_bonus.csv

,ID,Gender,City,Age,First Name,LastName,Project,Cost,Status,Designation Level,Bonus
0,A001,M,Paris,25,John,Alter,Project 1,1002000.0,Finished,2,50100.0
1,A001,M,Paris,25,John,Alter,Project 11,2000000.0,Failed,2,0.0
2,A001,M,Paris,25,John,Alter,Project 9,2210312.5,Ongoing,2,0.0
3,A002,F,London,27,Alice,Luxumberg,Project 2,2000000.0,Ongoing,2,0.0
4,A002,F,London,27,Alice,Luxumberg,Project 6,680000.0,Failed,2,0.0
5,A003,M,Berlin,29,Tom,Sabestine,Project 10,300000.0,Finished,3,15000.0
6,A003,M,Berlin,29,Tom,Sabestine,Project 3,4500000.0,Finished,3,225000.0
7,A003,M,Berlin,29,Tom,Sabestine,Project 8,350000.0,Failed,3,0.0
8,A004,F,Newyork,31,Nina,Adgra,Project 12,1000000.0,Ongoing,2,0.0
9,A004,F,Newyork,31,Nina,Adgra,Project 13,3000000.0,Finished,2,150000.0
10,A004,F,Newyork,31,Nina,Adgra,Project 4,5500000.0,Ongoing,2,0.0
11,A005,F,Madrid,30,Amy,Johny,Project 14,200000.0,Finished,3,10000.0
12,A005,F,Madrid,30,Amy,Johny,Project 5,3250500.0,Finished,3,162525.0
13,A005,F,Madrid,30,Amy,Johny,Project 7,400000.0,Finished,3,20000.0

 Employees with at least one failed project: ['A001', 'A002', 'A003']

 Applied demotions (by 1) to employees with failed projects.

      ID First Name   LastName     Project    Status  Designation Level
0   A001       John      Alter   Project 1  Finished                  2
1   A001       John      Alter  Project 11    Failed                  1
2   A001       John      Alter   Project 9   Ongoing                  2
3   A002      Alice  Luxumberg   Project 2   Ongoing                  2
4   A002      Alice  Luxumberg   Project 6    Failed                  1
5   A003        Tom  Sabestine  Project 10  Finished                  3
6   A003        Tom  Sabestine   Project 3  Finished                  3
7   A003        Tom  Sabestine   Project 8    Failed                  2
8   A004       Nina      Adgra  Project 12   Ongoing                  2
9   A004       Nina      Adgra  Project 13  Finished                  2
10  A004       Nina      Adgra   Project 4   Ongoing                  2
11  A005        Amy      Johny  Project 14  Finished                  3

 Removed rows with designation level > 4.
 - Rows count before change: 14
 - Rows count after change: 14

 Output File: Final_task6.csv
 Demoted employees with failed projects by 1 (min level = 1), and removed rows with designation > 4.

 Preview of the updated table:

,ID,Gender,City,Age,First Name,LastName,Project,Cost,Status,Designation Level,Bonus
0,A001,M,Paris,25,John,Alter,Project 1,1002000.0,Finished,2,50100.0
1,A001,M,Paris,25,John,Alter,Project 11,2000000.0,Failed,1,0.0
2,A001,M,Paris,25,John,Alter,Project 9,2210312.5,Ongoing,2,0.0
3,A002,F,London,27,Alice,Luxumberg,Project 2,2000000.0,Ongoing,2,0.0
4,A002,F,London,27,Alice,Luxumberg,Project 6,680000.0,Failed,1,0.0
5,A003,M,Berlin,29,Tom,Sabestine,Project 10,300000.0,Finished,3,15000.0
6,A003,M,Berlin,29,Tom,Sabestine,Project 3,4500000.0,Finished,3,225000.0
7,A003,M,Berlin,29,Tom,Sabestine,Project 8,350000.0,Failed,2,0.0
8,A004,F,Newyork,31,Nina,Adgra,Project 12,1000000.0,Ongoing,2,0.0
9,A004,F,Newyork,31,Nina,Adgra,Project 13,3000000.0,Finished,2,150000.0
10,A004,F,Newyork,31,Nina,Adgra,Project 4,5500000.0,Ongoing,2,0.0
11,A005,F,Madrid,30,Amy,Johny,Project 14,200000.0,Finished,3,10000.0
12,A005,F,Madrid,30,Amy,Johny,Project 5,3250500.0,Finished,3,162525.0
13,A005,F,Madrid,30,Amy,Johny,Project 7,400000.0,Finished,3,20000.0

**TASK 7 :** Add “Mr.” and “Mrs.” to the first name column and drop the gender column.

In [8]:

# ------------------------------------------------------------
# Task 7:
# Add "Mr." and "Mrs." to the First Name column and drop Gender.
# ------------------------------------------------------------

import os
import pandas as pd
import numpy as np
from IPython.display import display

# loads the recent file Task6 automatically
candidate_files = ["Final_task6.csv", "Final_with_bonus.csv", "Final.csv"]

input_file = None
for f in candidate_files:
    if os.path.exists(f):
        input_file = f
        break

if input_file is None:
    raise FileNotFoundError(
        "No input file found. Make sure one of these exists: "
        "Final_task6.csv, Final_with_bonus.csv, or Final.csv"
    )

print(f"\nLoaded Input File: {input_file}")
df = pd.read_csv(input_file)
display(df)

# Safety checks
required_cols = {"First Name", "Gender"}
missing = required_cols - set(df.columns)
if missing:
    raise ValueError(
        "Missing required columns: " + ", ".join(sorted(missing)) +
        "\nEnsure you're using the correct file produced by previous tasks."
    )

# Normalize fields
df["First Name"] = df["First Name"].astype(str).str.strip()
gender_clean = df["Gender"].astype(str).str.strip().str.upper()

# Avoid double-prefixing (names that already start with 'Mr.' or 'Mrs.')
already_prefixed = df["First Name"].str.startswith(("Mr.", "Mrs."))

# Compute prefixed names using vectorized logic
mr_prefixed   = "Mr. "  + df["First Name"]
mrs_prefixed  = "Mrs. " + df["First Name"]

# Apply rules:
# - If already prefixed -> keeping as-it is
# - Else if gender == 'M' -> add 'Mr.'
# - Else if gender == 'F' -> add 'Mrs.'
# - Else -> keep as-is
df["First Name"] = np.where(
    already_prefixed,
    df["First Name"],
    np.where(
        gender_clean == "M",
        mr_prefixed,
        np.where(gender_clean == "F", mrs_prefixed, df["First Name"])
    )
)

# Drop Gender column
df.drop(columns=["Gender"], inplace=True)

# Save output
output_file = "Final_task7.csv"
df.to_csv(output_file, index=False)

print(f"\nSaved: {output_file}")
print("Added 'Mr.'/'Mrs.' to First Name based on Gender and dropped the Gender column.")

# Preview
print("\nPreview of the updated table :")
display(df)

Loaded Input File: Final_task6.csv

,ID,Gender,City,Age,First Name,LastName,Project,Cost,Status,Designation Level,Bonus
0,A001,M,Paris,25,John,Alter,Project 1,1002000.0,Finished,2,50100.0
1,A001,M,Paris,25,John,Alter,Project 11,2000000.0,Failed,1,0.0
2,A001,M,Paris,25,John,Alter,Project 9,2210312.5,Ongoing,2,0.0
3,A002,F,London,27,Alice,Luxumberg,Project 2,2000000.0,Ongoing,2,0.0
4,A002,F,London,27,Alice,Luxumberg,Project 6,680000.0,Failed,1,0.0
5,A003,M,Berlin,29,Tom,Sabestine,Project 10,300000.0,Finished,3,15000.0
6,A003,M,Berlin,29,Tom,Sabestine,Project 3,4500000.0,Finished,3,225000.0
7,A003,M,Berlin,29,Tom,Sabestine,Project 8,350000.0,Failed,2,0.0
8,A004,F,Newyork,31,Nina,Adgra,Project 12,1000000.0,Ongoing,2,0.0
9,A004,F,Newyork,31,Nina,Adgra,Project 13,3000000.0,Finished,2,150000.0
10,A004,F,Newyork,31,Nina,Adgra,Project 4,5500000.0,Ongoing,2,0.0
11,A005,F,Madrid,30,Amy,Johny,Project 14,200000.0,Finished,3,10000.0
12,A005,F,Madrid,30,Amy,Johny,Project 5,3250500.0,Finished,3,162525.0
13,A005,F,Madrid,30,Amy,Johny,Project 7,400000.0,Finished,3,20000.0

Saved: Final_task7.csv
Added 'Mr.'/'Mrs.' to First Name based on Gender and dropped the Gender column.

Preview of the updated table :

,ID,City,Age,First Name,LastName,Project,Cost,Status,Designation Level,Bonus
0,A001,Paris,25,Mr. John,Alter,Project 1,1002000.0,Finished,2,50100.0
1,A001,Paris,25,Mr. John,Alter,Project 11,2000000.0,Failed,1,0.0
2,A001,Paris,25,Mr. John,Alter,Project 9,2210312.5,Ongoing,2,0.0
3,A002,London,27,Mrs. Alice,Luxumberg,Project 2,2000000.0,Ongoing,2,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,Project 6,680000.0,Failed,1,0.0
5,A003,Berlin,29,Mr. Tom,Sabestine,Project 10,300000.0,Finished,3,15000.0
6,A003,Berlin,29,Mr. Tom,Sabestine,Project 3,4500000.0,Finished,3,225000.0
7,A003,Berlin,29,Mr. Tom,Sabestine,Project 8,350000.0,Failed,2,0.0
8,A004,Newyork,31,Mrs. Nina,Adgra,Project 12,1000000.0,Ongoing,2,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,Project 13,3000000.0,Finished,2,150000.0
10,A004,Newyork,31,Mrs. Nina,Adgra,Project 4,5500000.0,Ongoing,2,0.0
11,A005,Madrid,30,Mrs. Amy,Johny,Project 14,200000.0,Finished,3,10000.0
12,A005,Madrid,30,Mrs. Amy,Johny,Project 5,3250500.0,Finished,3,162525.0
13,A005,Madrid,30,Mrs. Amy,Johny,Project 7,400000.0,Finished,3,20000.0

**TASK 8 :** Promote designation level by 1 for the employees whose age is more than 29 years using
IF condition.

In [9]:

# ------------------------------------------------------------
# Task 8:
# Promote designation level by 1 for employees whose age > 29
# using an IF condition. Save as Final_task8.csv
# ------------------------------------------------------------

import os
import pandas as pd
import numpy as np
from IPython.display import display

# Loading the recent file task7
candidate_files = ["Final_task7.csv", "Final_task6.csv", "Final_with_bonus.csv", "Final.csv"]

input_file = None
for f in candidate_files:
    if os.path.exists(f):
        input_file = f
        break

if input_file is None:
    raise FileNotFoundError(
        "No input file found. Please ensure one of these exists:\n"
        "Final_task7.csv, Final_task6.csv, Final_with_bonus.csv, or Final.csv"
    )

print(f"\nLoaded Input File: {input_file}")
df = pd.read_csv(input_file)
display(df)

# We need 'Age' and 'Designation Level' columns to do the promotion.
required_cols = {"Age", "Designation Level"}
missing = required_cols - set(df.columns)
if missing:
    raise ValueError(
        "Missing required columns: " + ", ".join(sorted(missing)) +
        "\nEnsure you're using the correct file produced by previous tasks."
    )

# Make sure 'Age' and 'Designation Level' are numeric
df["Age"] = pd.to_numeric(df["Age"], errors="coerce")
df["Designation Level"] = pd.to_numeric(df["Designation Level"], errors="coerce")

# Explicit IF inside a function
def promote_level(row):
    # IF condition: promote if Age > 29 (and Age is not NaN)
    if pd.notna(row["Age"]) and row["Age"] > 29:
        return row["Designation Level"] + 1
    else:
        return row["Designation Level"]

# Applying the if logic row-wise, then clip bounds to [1, 4]
df["Designation Level"] = df.apply(promote_level, axis=1).clip(lower=1, upper=4)

# Save the updated result to a new file for Task 8.
output_file = "Final_task8.csv"
df.to_csv(output_file, index=False)

print(f"\nSaved: {output_file}")
print("\nApplied promotion: +1 designation level for employees with Age > 29.")

# preview sorted by ID and Project
print("Sorted by ID, Project :")
display(df.sort_values(["ID", "Project"]).reset_index(drop=True))

# Show how many rows were promoted.
promoted_count = int(((pd.to_numeric(df["Age"], errors="coerce") > 29)).sum())
print(f"\nRows promoted (Age > 29): {promoted_count}")

Loaded Input File: Final_task7.csv

,ID,City,Age,First Name,LastName,Project,Cost,Status,Designation Level,Bonus
0,A001,Paris,25,Mr. John,Alter,Project 1,1002000.0,Finished,2,50100.0
1,A001,Paris,25,Mr. John,Alter,Project 11,2000000.0,Failed,1,0.0
2,A001,Paris,25,Mr. John,Alter,Project 9,2210312.5,Ongoing,2,0.0
3,A002,London,27,Mrs. Alice,Luxumberg,Project 2,2000000.0,Ongoing,2,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,Project 6,680000.0,Failed,1,0.0
5,A003,Berlin,29,Mr. Tom,Sabestine,Project 10,300000.0,Finished,3,15000.0
6,A003,Berlin,29,Mr. Tom,Sabestine,Project 3,4500000.0,Finished,3,225000.0
7,A003,Berlin,29,Mr. Tom,Sabestine,Project 8,350000.0,Failed,2,0.0
8,A004,Newyork,31,Mrs. Nina,Adgra,Project 12,1000000.0,Ongoing,2,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,Project 13,3000000.0,Finished,2,150000.0
10,A004,Newyork,31,Mrs. Nina,Adgra,Project 4,5500000.0,Ongoing,2,0.0
11,A005,Madrid,30,Mrs. Amy,Johny,Project 14,200000.0,Finished,3,10000.0
12,A005,Madrid,30,Mrs. Amy,Johny,Project 5,3250500.0,Finished,3,162525.0
13,A005,Madrid,30,Mrs. Amy,Johny,Project 7,400000.0,Finished,3,20000.0

Saved: Final_task8.csv

Applied promotion: +1 designation level for employees with Age > 29.
Sorted by ID, Project :

,ID,City,Age,First Name,LastName,Project,Cost,Status,Designation Level,Bonus
0,A001,Paris,25,Mr. John,Alter,Project 1,1002000.0,Finished,2,50100.0
1,A001,Paris,25,Mr. John,Alter,Project 11,2000000.0,Failed,1,0.0
2,A001,Paris,25,Mr. John,Alter,Project 9,2210312.5,Ongoing,2,0.0
3,A002,London,27,Mrs. Alice,Luxumberg,Project 2,2000000.0,Ongoing,2,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,Project 6,680000.0,Failed,1,0.0
5,A003,Berlin,29,Mr. Tom,Sabestine,Project 10,300000.0,Finished,3,15000.0
6,A003,Berlin,29,Mr. Tom,Sabestine,Project 3,4500000.0,Finished,3,225000.0
7,A003,Berlin,29,Mr. Tom,Sabestine,Project 8,350000.0,Failed,2,0.0
8,A004,Newyork,31,Mrs. Nina,Adgra,Project 12,1000000.0,Ongoing,3,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,Project 13,3000000.0,Finished,3,150000.0
10,A004,Newyork,31,Mrs. Nina,Adgra,Project 4,5500000.0,Ongoing,3,0.0
11,A005,Madrid,30,Mrs. Amy,Johny,Project 14,200000.0,Finished,4,10000.0
12,A005,Madrid,30,Mrs. Amy,Johny,Project 5,3250500.0,Finished,4,162525.0
13,A005,Madrid,30,Mrs. Amy,Johny,Project 7,400000.0,Finished,4,20000.0

Rows promoted (Age > 29): 6

**TASK 9 :** Add the cost of all projects for each Employee and save it in new dataframe
“TotalProjCost” with three columns ID, First Name, and Total cost

In [10]:

# ------------------------------------------------------------
# Task 9:
# Add the cost of all projects for each employee and save the
# result as a new dataframe/file "TotalProjCost.csv"
# with columns: ID, First Name, Total cost
# ------------------------------------------------------------

import os
import pandas as pd
from IPython.display import display

# loads the recent file Final_task8
candidate_files = [
    "Final_task8.csv",
    "Final_task7.csv",
    "Final_task6.csv",
    "Final_with_bonus.csv",
    "Final.csv"
]

input_file = None
for f in candidate_files:
    if os.path.exists(f):
        input_file = f
        break

if input_file is None:
    raise FileNotFoundError(
        "No input file found. Please ensure one of these exists:\n"
        "Final_task8.csv, Final_task7.csv, Final_task6.csv, Final_with_bonus.csv, or Final.csv"
    )

print(f"\nLoaded Input File: {input_file}")
df = pd.read_csv(input_file)
display(df)

# Need 'ID', 'First Name', and 'Cost' columns to perform the aggregation.
required_cols = {"ID", "First Name", "Cost"}
missing = required_cols - set(df.columns)
if missing:
    raise ValueError(
        "Missing required columns: " + ", ".join(sorted(missing)) +
        "\nEnsure you're using the correct file produced by previous tasks."
    )

# Make sure 'Cost' is numeric, so we can sum it correctly.
#    If any non-numeric values are present, they will be converted to NaN.
df["Cost"] = pd.to_numeric(df["Cost"], errors="coerce")

# Replace missing costs (NaN) with 0 for safe summation.
#    This ensures that projects with missing cost do not break the sum.
df["Cost"] = df["Cost"].fillna(0)

# Group the rows by employee (ID + First Name)
#    and compute the total cost of all their projects.
#    - We use 'as_index=False' to get a clean dataframe output.
total_cost_df = (
    df.groupby(["ID", "First Name"], as_index=False)["Cost"]
      .sum()
      .rename(columns={"Cost": "Total cost"})  # rename to match the exact requirement
)

# Sort the result for readability.
#    Sorting by ID and then First Name makes it easier to read/understand.
total_cost_df = total_cost_df.sort_values(["ID", "First Name"]).reset_index(drop=True)

# Saving the new dataframe to CSV as required by the task.
output_file = "TotalProjCost.csv"
total_cost_df.to_csv(output_file, index=False)

print(f"\nSaved: {output_file}")
print("\nCreated 'TotalProjCost' with columns: ID, First Name, Total cost.")

# Preview the first few rows to visually confirm.
print("Preview of 'TotalProjCost':")
display(total_cost_df)

Loaded Input File: Final_task8.csv

,ID,City,Age,First Name,LastName,Project,Cost,Status,Designation Level,Bonus
0,A001,Paris,25,Mr. John,Alter,Project 1,1002000.0,Finished,2,50100.0
1,A001,Paris,25,Mr. John,Alter,Project 11,2000000.0,Failed,1,0.0
2,A001,Paris,25,Mr. John,Alter,Project 9,2210312.5,Ongoing,2,0.0
3,A002,London,27,Mrs. Alice,Luxumberg,Project 2,2000000.0,Ongoing,2,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,Project 6,680000.0,Failed,1,0.0
5,A003,Berlin,29,Mr. Tom,Sabestine,Project 10,300000.0,Finished,3,15000.0
6,A003,Berlin,29,Mr. Tom,Sabestine,Project 3,4500000.0,Finished,3,225000.0
7,A003,Berlin,29,Mr. Tom,Sabestine,Project 8,350000.0,Failed,2,0.0
8,A004,Newyork,31,Mrs. Nina,Adgra,Project 12,1000000.0,Ongoing,3,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,Project 13,3000000.0,Finished,3,150000.0
10,A004,Newyork,31,Mrs. Nina,Adgra,Project 4,5500000.0,Ongoing,3,0.0
11,A005,Madrid,30,Mrs. Amy,Johny,Project 14,200000.0,Finished,4,10000.0
12,A005,Madrid,30,Mrs. Amy,Johny,Project 5,3250500.0,Finished,4,162525.0
13,A005,Madrid,30,Mrs. Amy,Johny,Project 7,400000.0,Finished,4,20000.0

Saved: TotalProjCost.csv

Created 'TotalProjCost' with columns: ID, First Name, Total cost.
Preview of 'TotalProjCost':

     ID  First Name  Total cost
0  A001    Mr. John   5212312.5
1  A002  Mrs. Alice   2680000.0
2  A003     Mr. Tom   5150000.0
3  A004   Mrs. Nina   9500000.0
4  A005    Mrs. Amy   3850500.0

**TASK 10 :** Print all the employee details whose city name contains the letter “o” in it.

In [11]:

# ------------------------------------------------------------
# Task 10:
# Print all the employee details whose city name contains 'o'
# (case-insensitive), using the latest "Final" CSV produced.
# ------------------------------------------------------------

import os
import pandas as pd
from IPython.display import display

# Loading the most recent file Final_task8.
candidate_files = [
    "Final_task8.csv",       # after promotions
    "Final_task7.csv",       # after titles & gender drop
    "Final_task6.csv",       # after demotions
    "Final_with_bonus.csv",  # after bonus
    "Final.csv"              # base final join
]

input_file = None
for f in candidate_files:
    if os.path.exists(f):
        input_file = f
        break

if input_file is None:
    raise FileNotFoundError(
        "No input file found. Please ensure one of these exists:\n"
        "Final_task8.csv, Final_task7.csv, Final_task6.csv, Final_with_bonus.csv, or Final.csv"
    )

print(f"\nLoaded Input File: {input_file}")

# Read the CSV into a pandas DataFrame.
df = pd.read_csv(input_file)
display(df)

# Ensure the 'City' column exists.
if "City" not in df.columns:
    raise ValueError(
        "The input file does not contain a 'City' column. "
        "Please verify that you're using the correct 'Final' file."
    )

# Normalize the City values:
#    - Convert to string in case there are non-string values.
#    - Strip leading/trailing spaces.
city_clean = df["City"].astype(str).str.strip()

# Creainge a boolean mask where the City contains the letter 'o' (case-insensitive).
#    Using .str.contains with case=False to match 'o' or 'O' and handle missing safely (na=False).
mask_has_o = city_clean.str.contains("o", case=False, na=False)

# Filter the DataFrame using the mask.
filtered_df = df[mask_has_o].copy()

# Print a summary and show the filtered rows.
count = len(filtered_df)
print(f"\nEmployees whose City contains the letter 'o': {count}")

# Displaying the filtered results.
display(filtered_df)

# Save the filtered result to a new file for reference.
output_file = "Employees_City_contains_o.csv"
filtered_df.to_csv(output_file, index=False)
print(f"\nSaved filtered results to: {output_file}")

Loaded Input File: Final_task8.csv

,ID,City,Age,First Name,LastName,Project,Cost,Status,Designation Level,Bonus
0,A001,Paris,25,Mr. John,Alter,Project 1,1002000.0,Finished,2,50100.0
1,A001,Paris,25,Mr. John,Alter,Project 11,2000000.0,Failed,1,0.0
2,A001,Paris,25,Mr. John,Alter,Project 9,2210312.5,Ongoing,2,0.0
3,A002,London,27,Mrs. Alice,Luxumberg,Project 2,2000000.0,Ongoing,2,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,Project 6,680000.0,Failed,1,0.0
5,A003,Berlin,29,Mr. Tom,Sabestine,Project 10,300000.0,Finished,3,15000.0
6,A003,Berlin,29,Mr. Tom,Sabestine,Project 3,4500000.0,Finished,3,225000.0
7,A003,Berlin,29,Mr. Tom,Sabestine,Project 8,350000.0,Failed,2,0.0
8,A004,Newyork,31,Mrs. Nina,Adgra,Project 12,1000000.0,Ongoing,3,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,Project 13,3000000.0,Finished,3,150000.0
10,A004,Newyork,31,Mrs. Nina,Adgra,Project 4,5500000.0,Ongoing,3,0.0
11,A005,Madrid,30,Mrs. Amy,Johny,Project 14,200000.0,Finished,4,10000.0
12,A005,Madrid,30,Mrs. Amy,Johny,Project 5,3250500.0,Finished,4,162525.0
13,A005,Madrid,30,Mrs. Amy,Johny,Project 7,400000.0,Finished,4,20000.0

Employees whose City contains the letter 'o': 5

,ID,City,Age,First Name,LastName,Project,Cost,Status,Designation Level,Bonus
3,A002,London,27,Mrs. Alice,Luxumberg,Project 2,2000000.0,Ongoing,2,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,Project 6,680000.0,Failed,1,0.0
8,A004,Newyork,31,Mrs. Nina,Adgra,Project 12,1000000.0,Ongoing,3,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,Project 13,3000000.0,Finished,3,150000.0
10,A004,Newyork,31,Mrs. Nina,Adgra,Project 4,5500000.0,Ongoing,3,0.0

Saved filtered results to: Employees_City_contains_o.csv